import type { Review } from "~/types/review";

export const mockReviews: Review[] = [
  {
    id: "mock-shafir",
    name: "שפיר",
    role: "",
    message:
      "טל המורה הכי טובה שיצא לי להכיר ולפגוש. הכי סבלנית שיש, יודעת להעביר את החומר בצורה הכי ברורה שאפשר שיש. לימדה אותי הרבה קורסים ובזכותה קיבלתי ציונים גבוהים. לא תתאכזבו לרגע ממנה. ומעבר לזה שהיא מורה סופר תותחית היא גם חברה טובה מאוד שדואגת ועוזרת!",
    rating: 5,
    status: "approved",
    createdAt: "2025-01-01T00:00:00.000Z",
  },
  {
    id: "mock-shaked",
    name: "שקד",
    role: "",
    message:
      "טל היא מורה מדהימה, היא יודעת בדיוק איך ללמד באופן שיתאים לתלמיד הספציפי וכל הניואנסים שלו. ברגע שפגשתי אותה רציתי שכל המרצים שלי ילמדו כמוה ותמיד אני פונה אליה בקשר לשיעורי עזר.",
    rating: 5,
    status: "approved",
    createdAt: "2025-01-01T00:00:00.000Z",
  },
  {
    id: "mock-batel",
    name: "בתאל",
    role: "",
    message:
      "זכיתי ללמוד אצל טל כמורה פרטית, ואין לי ספק שהיא אחת הטובות שפגשתי. היא מקצועית, אכפתית וסבלנית, ותמיד מתאימה את עצמה לקצב שלי. רואים שהיא אוהבת ללמד ומשקיעה מכל הלב. ממליצה עליה בחום לכל מי שמחפש/ת מורה פרטית איכותית.",
    rating: 5,
    status: "approved",
    createdAt: "2025-01-01T00:00:00.000Z",
  },
  {
    id: "mock-moti",
    name: "מוטי",
    role: "",
    message:
      "פשוט וואו, טל מורה מהממת עם הרבה סבלנות, בקיאות שלה בחומר והסברים ידידותיים שלה סייעו לי לעבור בהצלחה מבחנים במדעי המחשב שהיו קשים לי מאוד. ממליץ בחום!",
    rating: 5,
    status: "approved",
    createdAt: "2025-01-01T00:00:00.000Z",
  },
  {
    id: "mock-or",
    name: "אור",
    role: "",
    message:
      "המורה הכי טובה שהייתה לי בתואר! לפני שלמדתי עם טל התקשיתי מאוד להבין את הפואנטה שבקורסים ולעמוד בקצב אבל טל לימדה אותי איך לחבר בין כל הנקודות ולהבין באמת את החומר! פשוט בן אדם עם לב ענק שלא יוותר לכם עד שתבינו... ממליץ בחום!",
    rating: 5,
    status: "approved",
    createdAt: "2025-01-01T00:00:00.000Z",
  },
];
